In [1]:
import pandas as pd
import numpy as np

In [2]:
salaries = pd.read_csv('salaries.csv')

In [4]:
salaries.head()

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [5]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          607 non-null    int64
 1   work_year           607 non-null    int64
 2   experience_level    607 non-null    object
 3   employment_type     607 non-null    object
 4   job_title           607 non-null    object
 5   salary              607 non-null    int64
 6   salary_currency     607 non-null    object
 7   salary_in_usd       607 non-null    int64
 8   employee_residence  607 non-null    object
 9   remote_ratio        607 non-null    int64
 10  company_location    607 non-null    object
 11  company_size        607 non-null    object
dtypes: int64(5), object(7)
memory usage: 57.0+ KB

In [6]:
salaries.describe()

       Unnamed: 0    work_year        salary  salary_in_usd  remote_ratio
count  607.000000   607.000000  6.070000e+02     607.000000     607.00000
mean   303.000000  2021.405272  3.240001e+05  112297.869852      70.92257
std    175.370085     0.692133  1.544357e+06   70957.259411      40.70913
min      0.000000  2020.000000  4.000000e+03    2859.000000       0.00000
25%    151.500000  2021.000000  7.000000e+04   62726.000000      50.00000
50%    303.000000  2022.000000  1.150000e+05  101570.000000     100.00000
75%    454.500000  2022.000000  1.650000e+05  150000.000000     100.00000
max    606.000000  2022.000000  3.040000e+07  600000.000000     100.00000

In [10]:
salaries.isna().sum()

Unnamed: 0            0
work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [14]:
avg_yearly_salaries = salaries.groupby('work_year')['salary'].mean()

avg_yearly_salaries

work_year
2020    382386.236111
2021    546677.387097
2022    158827.786164
Name: salary, dtype: float64

In [15]:
median_yearly_salaries = salaries.groupby('work_year')['salary'].median()

median_yearly_salaries

work_year
2020     94500
2021    100000
2022    123000
Name: salary, dtype: int64

In [18]:
def best (df,n=1, column='salary'):
    return df.sort_values(by=column, ascending=False) [:n]

In [20]:
best(salaries, n=3)

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
177,177,2021,MI,FT,Data Scientist,30400000,CLP,40038,CL,100,CL,L
7,7,2020,MI,FT,Data Scientist,11000000,HUF,35735,HU,50,HU,L
102,102,2021,MI,FT,BI Data Analyst,11000000,HUF,36259,HU,50,US,L

In [21]:
salaries.groupby(['work_year', 'experience_level'])['salary'].median()

work_year  experience_level
2020       EN                   71000
           EX                  197500
           MI                   87500
           SE                  127500
2021       EN                   72500
           EX                  150000
           MI                   91500
           SE                  150000
2022       EN                   65000
           EX                  200000
           MI                   80000
           SE                  138600
Name: salary, dtype: int64

In [22]:
salaries.groupby(['work_year', 'company_size'])['salary'].median()

work_year  company_size
2020       L               100000
           M               124000
           S                60000
2021       L               130000
           M                82500
           S                85000
2022       L               142200
           M               123000
           S                65000
Name: salary, dtype: int64

In [23]:
salaries.groupby(['experience_level', 'company_size'])['salary'].median()

experience_level  company_size
EN                L                72000.0
                  M                52400.0
                  S                85000.0
EX                L               235000.0
                  M               171437.5
                  S               150000.0
MI                L               107500.0
                  M                80000.0
                  S                58000.0
SE                L               157600.0
                  M               135000.0
                  S               112500.0
Name: salary, dtype: float64

In [27]:
salaries.groupby(['job_title'])['salary'].median().sort_values(ascending=False)

job_title
Head of Machine Learning                    6000000.0
Data Analytics Lead                          405000.0
3D Computer Vision Researcher                400000.0
Financial Data Analyst                       275000.0
ML Engineer                                  263000.0
NLP Engineer                                 240000.0
Product Data Analyst                         235000.0
Principal Data Engineer                      200000.0
Head of Data                                 200000.0
Lead Data Scientist                          190000.0
Data Architect                               180000.0
Analytics Engineer                           179850.0
Lead Data Analyst                            170000.0
Director of Data Science                     168000.0
Data Science Manager                         167671.0
Data Specialist                              165000.0
Applied Data Scientist                       157000.0
Machine Learning Manager                     157000.0
Machine Learning Scientist                   156500.0
Principal Data Scientist                     151000.0
Data Engineering Manager                     150000.0
Director of Data Engineering                 141250.0
Cloud Data Engineer                          140000.0
Head of Data Science                         138937.5
Lead Data Engineer                           137500.0
Big Data Architect                           125000.0
Principal Data Analyst                       122500.0
Data Scientist                               120160.0
AI Scientist                                 120000.0
Machine Learning Engineer                    120000.0
Data Analytics Manager                       120000.0
Data Engineer                                110000.0
Staff Data Scientist                         105000.0
Machine Learning Developer                   100000.0
Business Data Analyst                        100000.0
BI Data Analyst                               99000.0
Big Data Engineer                             92500.0
Data Analyst                                  91000.0
Computer Vision Engineer                      81000.0
Computer Vision Software Engineer             81000.0
Lead Machine Learning Engineer                80000.0
Marketing Data Analyst                        75000.0
Research Scientist                            74999.5
Data Science Consultant                       65000.0
Data Science Engineer                         60000.0
Data Analytics Engineer                       58500.0
Applied Machine Learning Scientist            56700.0
Machine Learning Infrastructure Engineer      53000.0
ETL Developer                                 50000.0
Finance Data Analyst                          45000.0
Name: salary, dtype: float64

In [28]:
salaries.groupby('remote_ratio')['salary'].median()

remote_ratio
0      102100
50      76760
100    123000
Name: salary, dtype: int64

In [29]:
salaries.groupby(['remote_ratio', 'company_size'])['salary'].median()

remote_ratio  company_size
0             L               127500
              M                99000
              S                74800
50            L                82500
              M                65720
              S                77500
100           L               147000
              M               128875
              S                80000
Name: salary, dtype: int64

In [31]:
salaries.groupby(['remote_ratio', 'experience_level'])['salary'].median()

remote_ratio  experience_level
0             EN                   66000.0
              EX                  120000.0
              MI                   75000.0
              SE                  140400.0
50            EN                   58000.0
              EX                  230000.0
              MI                   68999.5
              SE                  120000.0
100           EN                   72000.0
              EX                  187500.0
              MI                  100000.0
              SE                  140000.0
Name: salary, dtype: float64